# ОТЧЁТ ПО КОНТРОЛЬНОЙ РАБОТЕ №2
**Дисциплина:** Программирование  
**Студент:** Никита (замените на Ф.И.О.)  
**Группа:** УИБО-0Х-2X  
**Преподаватель:** Морозов В. А.  
**Город:** Москва  
**Год:** 2025

---

## СОДЕРЖАНИЕ
1. ЗАДАНИЕ №1  
  1.1 Условие задачи  
  1.2 Архитектура системы  
  1.3 Алгоритм решения задачи  
  1.4 Инструментарий решения задачи  
  1.5 Код на языке C++ (src/main.cpp)  
  1.6 Тестирование (tests/)  
2. ЗАДАНИЕ №2 (шаблон)  
Выводы, Список использованных источников, Приложения

---

# ЗАДАНИЕ №1

## 1.1 Условие задачи
Напишите программу, которая будет проверять вводимое число пользователем на чётность и выводить `even` для чётных и `uneven` для нечётных чисел.

## 1.2 Архитектура системы
Решение оформлено как простая консольная программа на C++.  
Структура репозитория:
- `src/main.cpp` — исходный код программы.
- `tests/` — тестовые сценарии и скрипт запуска.
- `REPORT.md` — этот файл.
- `actions/` — отдельные отчёты по этапам.

## 1.3 Алгоритм решения задачи
1. Считать целое число `a` из стандартного ввода.  
2. Вычислить `a % 2`.  
3. Если остаток равен 0 — вывести `even`, иначе — `uneven`.  
4. Завершить программу с кодом возврата 0.

Блок-схема алгоритма (текстовое описание):
- Ввод `a` → условие `a % 2 == 0?` → Да: `cout << "even"` → Нет: `cout << "uneven"` → Выход.

## 1.4 Инструментарий решения задачи
- Язык: C++ (стандарт C++11 совместимый).
- Компилятор: g++ (рекомендуется).
- Средства тестирования: bash-скрипт + перенаправление входа/выхода.
- Файловая структура для загрузки в GitHub.

## 1.5 Код на языке C++
Файл: `src/main.cpp`
(полный листинг — в репозитории)

```cpp
#include <iostream>

int main() {
    long long a;
    if(!(std::cin >> a)) {
        // если ввод некорректен — завершаем с ошибкой
        return 1;
    }
    if (a % 2 == 0) {
        std::cout << "even";
    } else {
        std::cout << "uneven";
    }
    return 0;
}
```

## 1.6 Тестирование
Таблица тестирования:

| Вход | Ожидаемый вывод | Фактический вывод |
|------|------------------|-------------------|
| 2    | even             | even              |
| -2   | even             | even              |
| -1   | uneven           | uneven            |
| 11   | uneven           | uneven            |
| 0    | even             | even              |

Скрипт в `tests/run_tests.sh` автоматически компилирует и запускает программу с тестовыми входными данными, сравнивает результаты и печатает сводку.

---

# ЗАДАНИЕ №2
(Шаблон: заполните условия и решение здесь при появлении задания.)

---

# ВЫВОДЫ
В результате выполнения практической работы была разработана простая и надёжная консольная программа, корректно определяющая чётность целых чисел. Проведено тестирование на наборе контрольных значений; результаты совпадают с ожидаемыми.

# СПИСОК ИСПОЛЬЗОВАННЫХ ИСТОЧНИКОВ
1. Т. А. Павловская. C/C++. Программирование на языке высокого уровня. СПб.: Питер, 2018.
2. Ritchie D., Kernighan B. The C Programming Language.

# ПРИЛОЖЕНИЯ
- Листинг исходного кода: `src/main.cpp`
- Скрипт тестирования: `tests/run_tests.sh`
- Файлы с тестами: `tests/test_cases.txt`
